# Module 5 Data Data Engineering

### Topics
- How to deal with empty/missing/null values
- How to deal with duplicates

**Notes**:
- Python has a value called **None**. This type represents an unknown value in Python.
- **None** is not used as often as **NaN**.
  - **NaN** - stands for Not a Number. It is a **float** type to represent a missing or undefined value.
  - **NaN** - is commonly used in processing null values.
  - **NaN** -  this value cannot be compared. 
  - use **math.isnan()** to determine if the variable is NaN.
  - Pandas uses **isna()** to tell if a value is NaN.
- Can assign NaN to almost any data structure.
- Pandas will automatically will assign NaN to empty cells in a CSV file.
- **.isnull()** - is a Pandas function that returns null for empty values within the dataframe.
- **dropna(inplace=True)** - **Note**: Will lose the original data by doing so.  It may be a good idea to keep the original dataframe.
- **.duplicated()** - this will return a True or False if the values are duplicated. It will return false only if it is the first time that a value is seen otherwise it will return a true value.

In [1]:
x = None

type(x)

NoneType

In [2]:
print(x)

None

In [3]:
x == None

True

In [4]:
y = 2
y == None

False

In [5]:
# None can be treated as an element.
l = [3, 1, None, 5, 12]

len(l)

5

In [6]:
# Simple way to count the number of None (unknown) values in a list.
missing = 0

for x in l:
    if x == None:
        missing = missing + 1

print(missing)

1

In [7]:
import math

y = math.nan

type(y)

float

In [8]:
print(y)

nan

In [9]:
# can assign a NaN value using float().
z = float('nan')

type(z)

float

In [10]:
# Cannont be cpmpared.
print(z > 10)
print(z < 10)
print(z == 10)

False
False
False

In [11]:
# use math.isnan() to decide if the variable is NaN.
math.isnan(z)

True

In [12]:
# Pandas uses isna() to tell if a value is NaN.
import pandas as pd
pd.isna(z)

True

In [13]:
#Numpy 
import numpy as np
np.isnan(z)

True

In [14]:
# list with a NaN value created

n = [4.3, 1.2, float('nan'), 2.7]
n

[4.3, 1.2, nan, 2.7]

In [15]:
type(n[2])

float

In [16]:
# Load a CSV file with missing  or empty cells

df = pd.read_csv('test.csv')

df

   Name   Age
0  John  20.0
1  Mary  19.0
2   Tom   NaN
3   NaN  23.0

In [17]:
print(df.iloc[2, 1])

nan

In [18]:
type(df.iloc[2, 1])

numpy.float64

In [19]:
math.isnan(df.iloc[2, 1])

True

In [20]:
# Using Pandas method
df.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3   True  False

In [21]:
# Will return the opposite of the isnull() function.
df.notnull()

    Name    Age
0   True   True
1   True   True
2   True  False
3  False   True

In [22]:
# Can use fillna() to fill in within a predefinded values
df1 = df.fillna("TEST")

df1

   Name   Age
0  John  20.0
1  Mary  19.0
2   Tom  TEST
3  TEST  23.0

In [23]:
# To drop the NaN values from the dataframe
df2 = df.dropna()

df2

   Name   Age
0  John  20.0
1  Mary  19.0

In [24]:
# To show that the original dataframe is the same.
df

   Name   Age
0  John  20.0
1  Mary  19.0
2   Tom   NaN
3   NaN  23.0

In [25]:
# To drop the NaN in place use the inplace parameter.
df.dropna(inplace=True)

df

   Name   Age
0  John  20.0
1  Mary  19.0

## How to deal with duplicates

**Notes**:

In [26]:
l = [3, 4, 5, 4]

l

[3, 4, 5, 4]

In [27]:
# Converting list to a set will get rid of duplicate values
s = set(l)

s

{3, 4, 5}

In [28]:
len(l) == len(s)

False

In [29]:
# Using a Pandas DataFrame
# Creating a Pandas DataFrame

data = pd.DataFrame({'k1':['one'] * 3 + ['two'] * 4,'k2':[1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [30]:
# Pandas method to determine duplicates within a DataFrame
# This method is boolean return

data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

### Removing duplicates from a dataframe

In [31]:
# Using the parameter **keep** to keep the first occurence of the duplicated value
data1 = data.drop_duplicates(keep='first')

data1

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [32]:
# Keeps the last copy of the duplicated data.

data2 = data.drop_duplicates(keep='last')

data2

    k1  k2
1  one   1
2  one   2
4  two   3
6  two   4

In [33]:
data1

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [34]:
# only remove rows with duplicated k1 columns

data3 = data.drop_duplicates('k1')

data3

    k1  k2
0  one   1
3  two   3

In [35]:
# Remove all duplicates and maintain one copy of the dataframe
data.drop_duplicates(inplace=True)

data

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

### How to merge data

**Notes**:
-

In [36]:
# Create two dataframes

df1 = pd.DataFrame({'A':[1,2,3,4], 'B':[5,6,7,8]})
df2 = pd.DataFrame({'A':[10, 20, 30 , 40], 'B':[50, 60, 70 ,80]})

df1

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [37]:
df2

    A   B
0  10  50
1  20  60
2  30  70
3  40  80

### To join two dataframes together using the append and concat methods

In [38]:
# Append df2 to df1 
#df3 = df1.append(df2)

df3 = pd.concat([df1, df2])

df3

    A   B
0   1   5
1   2   6
2   3   7
3   4   8
0  10  50
1  20  60
2  30  70
3  40  80

In [39]:
# To remove duplicate indices 
df3 = pd.concat([df1, df2], ignore_index=True)

df3

    A   B
0   1   5
1   2   6
2   3   7
3   4   8
4  10  50
5  20  60
6  30  70
7  40  80

In [40]:
# Create dateframe one with two columns and one with three columns

df5 = pd.DataFrame({'A':[1,2,3,4], 'B':[5,6,7,8]})
df6 = pd.DataFrame({'A':[10, 20, 30 , 40], 'B':[50, 60, 70 ,80], 'C':[11, 13, 15, 19]})

In [41]:
df7 = pd.concat([df5, df6], ignore_index=True)

df7

    A   B     C
0   1   5   NaN
1   2   6   NaN
2   3   7   NaN
3   4   8   NaN
4  10  50  11.0
5  20  60  13.0
6  30  70  15.0
7  40  80  19.0

In [42]:
# confirm that a cell has an NaN
pd.isna(df7.iloc[0,2])

True

In [43]:
df1 = pd.DataFrame({'A':['one','two','three','one'], 'value':[1, 2, 3, 5]})
df2 = pd.DataFrame({'B':['one','two','three','one'], 'value':[5, 6, 7, 8]})

df1

       A  value
0    one      1
1    two      2
2  three      3
3    one      5

In [44]:
df2

       B  value
0    one      5
1    two      6
2  three      7
3    one      8

In [45]:
# merge the dataframes on the columns
df1.merge(df2, left_on='A', right_on='B')

       A  value_x      B  value_y
0    one        1    one        5
1    one        1    one        8
2    two        2    two        6
3  three        3  three        7
4    one        5    one        5
5    one        5    one        8

In [46]:
df1.merge(df2, left_on='A', right_on='B', suffixes=('_first', '_second'))

       A  value_first      B  value_second
0    one            1    one             5
1    one            1    one             8
2    two            2    two             6
3  three            3  three             7
4    one            5    one             5
5    one            5    one             8

In [47]:
df1 = pd.DataFrame({'A':['one','two'], 'B':[1, 2]})
df2 = pd.DataFrame({'A':['one','three'], 'C':[3, 4]})

df1

     A  B
0  one  1
1  two  2

In [48]:
df2

       A  C
0    one  3
1  three  4

### Joins (merge) on dataframes
- Inner
- Left
- right
- outer
- cross

In [49]:
# inner join
df1.merge(df2, how='inner', on='A')

     A  B  C
0  one  1  3

In [50]:
# left join
df1.merge(df2, how='left', on='A')

     A  B    C
0  one  1  3.0
1  two  2  NaN

In [51]:
# right join
df1.merge(df2, how='right', on='A')

       A    B  C
0    one  1.0  3
1  three  NaN  4

In [52]:
# outer join
df1.merge(df2, how='outer', on='A')

       A    B    C
0    one  1.0  3.0
1  three  NaN  4.0
2    two  2.0  NaN

In [53]:
# cross join (Cartesian Product)
df1.merge(df2, how='cross')

   A_x  B    A_y  C
0  one  1    one  3
1  one  1  three  4
2  two  2    one  3
3  two  2  three  4